app/controllers/admin/categories_controller.rb

        def index
                @categories=Category.paginate :page => params[:page], :per_page => 3, :conditions => ["category_name like ?","#{params[:search]}%"]
---
SELECT * FROM `categories` WHERE (category_name like '%') LIMIT 0, 4
SELECT count(*) AS count_all FROM `categories` WHERE (category_name like '%')

        def create
                @category=Category.new(params[:category])
                if @category.save
---
INSERT INTO `categories` (`category_id`, `category_name`, `description`, `created_at`, `updated_at`, `cat_file_name`, `cat_content_type`, `cat_file_size`, `cat_updated_at`) VALUES(NULL, 'Kids', 'sfthgsfg sfg stg dsfg sfgb', '2011-07-15 09:05:36', '2011-07-15 09:05:36', 'image9.jpeg', 'image/jpeg', 8114, '2011-07-15 09:05:36')

         def auto_complete_for_category_category_name
                name = params[:category][:category_name]
                @categories = Category.find(:all,:conditions => ['category_name LIKE ?', "#{name}%"])
---
SELECT * FROM `categories` WHERE (category_name LIKE 'c%')

        def product_listing
                   @products = Product.paginate :page => params[:page], :per_page => 3, :conditions => ['category_id =?', params[:id]]
---
SELECT * FROM `products` WHERE (category_id ='2') LIMIT 0, 1
SELECT count(*) AS count_all FROM `products` WHERE (category_id ='2')