app/controllers/admin/products_controller.rb

SELECT * FROM `products` WHERE (product_name like '%') LIMIT 0, 3
SELECT count(*) AS count_all FROM `products` WHERE (product_name like '%')
---
        def index
                @products = Product.paginate :page => params[:page], :per_page => 3, :conditions => ["product_name like ?","#{params[:search]}%"]

INSERT INTO `products` (`product_id`, `category_id`, `product_name`, `price`, `description`, `created_at`, `updated_at`, `kvr_file_name`, `kvr_content_type`, `kvr_file_size`, `kvr_updated_at`) VALUES(NULL, 1, 'Formals', 1560, 'dfjkvnkjsn sjkfn snfv', '2011-07-15 08:46:19', '2011-07-15 08:46:19', NULL, NULL, NULL, NULL)
---
        def create
                @product=Product.new(params[:product])
                #@product.kvr = params[:product][:kvr]
                if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 3)
---
         def add_product_to_session
                @product=Product.find(params[:id])

SELECT * FROM `products` WHERE (product_name LIKE 'n%')
---
        def auto_complete_for_product_product_name
                name = params[:product][:product_name]
                @products = Product.find(:all,:conditions => ['product_name LIKE ?', "#{name}%"])