app/controllers/users_controller.rb

  def create
   # logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`) VALUES('kvramana', '', 'kvramana.sbm57@gmail.com', '220777f00e9cd0308cfc77ef362153310aba6f28', 'a9eb0e48421fcec8e82db80a11415091157ce473', '2011-07-16 05:06:59', '2011-07-16 05:06:59', NULL, NULL)